<template>
  <div class="hello">    
    <h1>{{ msg }}</h1>
     
    <p>
      Еще в 1993 году некому В.Плесову был выдан патент № 1716953 на изобретение игры-головоломки «Лоцман».  От известной игры «15» она отличается не только количеством фишек, но и их формой.

Саму игрушку изготовить несложно. Для этого можно воспользоваться косточками домино. Квадратный игровой элемент — «кораблик» — из них же. Думаю, что из рисунка все понятно. Останется только изготовить игровое поле — планшетку-коробочку с невысокими бортами, не зажимающую косточки при передвижении.

Задача играющего состоит в том, чтобы провести «кораблик» из правого нижнего угла игрового поля в верхний левый свободный угол — «гавань», поочередно передвигая прямоугольные игровые элементы — «рифы».

На рисунке представлено одно из стартовых игровых положений. Из него «кораблик» удается провести за 111 ходов. Возможно, кто-то из читателей найдет более короткое решение.
      </p>
      <img src="../assets/rp_picture.jpg" width="50%" />
      <p>Допустимо любое стартовое положение игровых элементов — от очень простого до очень сложного. Необходимо соблюдать только одно важное условие: начальная ситуация должна быть все же такой, чтобы задача в итоге решалась.

Несмотря на кажущуюся техническую простоту, данная игра — сложная головоломка. Уверен, что многие проведут за ней не один час, пытаясь преодолеть «рифы» и провести «кораблик».

Желаю всем удачи!
    </p>
  </div>
</template>

<script>

export default {
  name: 'HelloWorld',
  props: {
    msg: String
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
h3 {
  margin: 40px 0 0;
}
ul {
  list-style-type: none;
  padding: 0;
}
li {
  display: inline-block;
  margin: 0 10px;
}
a {
  color: #42b983;
}
</style>
